# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [1]:
import pandas as pd
import mysql.connector

### Connect to DB using Mysql-connector-python package

In [4]:
myConnection=mysql.connector.connect(user='root', password='1234',
                              host='localhost')
conObject=myConnection.cursor()

### You are required to create a database named 'e_commerce'

In [5]:
conObject.execute("Create Database e_commerse")

In [2]:
myConnection=mysql.connector.connect(user='root', password='1234',
                              host='localhost', database='e_commerse')
conObject=myConnection.cursor()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [21]:
createTables="""create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
create table customer (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
create table category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
create table product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
create table orders (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))
"""
conObject.execute(createTables)

ProgrammingError: 1050 (42S01): Table 'supplier' already exists

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [13]:
insertSupplier="""insert into supplier(supp_id,supp_name,supp_city,supp_phone) values(%s,%s,%s,%s)"""

val =[(1,'Rajesh Retails','Delhi','1234567890'),
      (2,'Appario Ltd.','Mumbai','8963147032'),
      (3,'Knome products','Bangalore','9785462315'),
      (4,'Bansal Retails','Kochi','8975463285'),
      (5,'Mittal Ltd.','Lucknow','7898456532')]

conObject.executemany(insertSupplier,val)
myConnection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [15]:
insertCustomer="""insert into customer(cus_id,cus_name,cus_phone,cus_city,cus_gender) values(%s,%s,%s,%s,%s)"""

val =[(1,'AAKASH','9999999999','DELHI','M'),
      (2,'AMAN','9785463215','NOIDA','M'),
      (3,'NEHA','9999999998','MUMBAI','F'),
      (4,'MEGHA','9994562399','KOLKATA','F'),
      (5,'PULKIT','7895999999','LUCKNOW','M')]

conObject.executemany(insertCustomer,val)
myConnection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [16]:
insertCategory="""insert into category(cat_id,cat_name) values(%s,%s)"""

val =[(1,'BOOKS'),
      (2,'GAMES'),
      (3,'GROCERIES'),
      (4,'ELECTRONICS'),
      (5,'CLOTHES')]

conObject.executemany(insertCategory,val)
myConnection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [17]:
# insert into "product" table

insertProduct="""insert into product(pro_id,pro_name,pro_desc,cat_id) values(%s,%s,%s,%s)"""

val =[(1,'GTA V','DFJDJFDJFDJFDJFJF',2),
      (2,'TSHIRT','DFDFJDFJDKFD',5),
      (3,'ROG LAPTOP','DFNTTNTNTERND',4),
      (4,'OATS','REURENTBTOTH',3),
      (5,'HARRY POTTER','NBEMCTHTJTH',1)]

conObject.executemany(insertProduct,val)
myConnection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [18]:
# insert into "product_details" table
insertPdetails="""insert into product_details(prod_id,pro_id,supp_id,prod_price) values(%s,%s,%s,%s)"""

val =[(1,1,2,1500),
      (2,3,5,30000),
      (3,5,1,3000),
      (4,2,3,2500),
      (5,4,1,1000)]

conObject.executemany(insertPdetails,val)
myConnection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [22]:
# insert into "orders" table

insertOrders="""insert into orders(ord_id,ord_amount,ord_date,cus_id,prod_id) values(%s,%s,%s,%s,%s)"""

val =[(20,1500,'2021-10-12',3,5),
      (25,30500,'2021-09-16',5,2),
      (26,2000,'2021-10-05',1,1),
      (30,3500,'2021-08-16',4,3),
      (50,2000,'2021-10-06',2,1)]

conObject.executemany(insertOrders,val)
myConnection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [24]:
# insert into "rating" table
insertRating="""insert into rating(rat_id,cus_id,supp_id,rat_ratstars) values(%s,%s,%s,%s)"""

val =[(1,2,2,4),
      (2,3,4,3),
      (3,5,1,5),
      (4,1,3,2),
      (5,4,5,4)]

conObject.executemany(insertRating,val)
myConnection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [25]:
import pandas as pd

In [36]:
queryOne="""select cus_gender,count(*) as No_of_Customers from customer c
inner join (
select distinct cus_id from orders where ord_amount>=3000) b
on c.cus_id=b.cus_id
group by cus_gender"""
conObject.execute(queryOne)
outOne=conObject.fetchall()
outOne_Df=pd.DataFrame(outOne,columns=['Cus_Gender','No_of_Customer'])
outOne_Df

  Cus_Gender  No_of_Customer
0          F               1
1          M               1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [38]:
queryTwo="""select o.ord_id,ord_date,ord_amount,p.pro_name from product p inner join
(select * from orders
where cus_id=2) o on p.pro_id=o.prod_id"""

conObject.execute(queryTwo)
outTwo=conObject.fetchall()
outTwo_Df=pd.DataFrame(outTwo,columns=['Order_ID','Order_date','Order_Amount','Produt_name'])
outTwo_Df

   Order_ID  Order_date  Order_Amount Produt_name
0        50  2021-10-06          2000       GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [6]:
queryThree="""select supp_name,supp_city,supp_phone from supplier a
inner join(
select supp_id from product_details
group by supp_id
having count(*)>1) b
on a.supp_id=b.supp_id """

conObject.execute(queryThree)
outThree=conObject.fetchall()
outThree_Df=pd.DataFrame(outThree,columns=['Supp_Name','Supp_City','Supp_Phone'])
outThree_Df

        Supp_Name Supp_City  Supp_Phone
0  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [7]:
queryFour="""select cat_name from category c inner join (
select cat_id,prod_id from product a inner join (
select prod_id from orders where ord_amount in (
select min(ord_amount) from orders)) b
on a.pro_id=b.prod_id) f
on c.cat_id=f.cat_id """

conObject.execute(queryFour)
outFour=conObject.fetchall()
outFour_Df=pd.DataFrame(outFour,columns=['Category_Name'])
outFour_Df

  Category_Name
0         BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [8]:
queryFive="""select pro_id,Pro_name from product a
inner join (
select * from orders
where ord_date>'2021-10-05') b
on a.pro_id=b.prod_id
order by pro_id """

conObject.execute(queryFive)
outFive=conObject.fetchall()
outFive_Df=pd.DataFrame(outFive,columns=['Prod_ID','Product'])
outFive_Df

   Prod_ID       Product
0        1         GTA V
1        5  HARRY POTTER

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [13]:
query6="""
select a.supp_id,supp_name,rat_ratstars as Ratings,cus_name from supplier a inner join
(select supp_id,rat_ratstars,cus_id from rating
order by rat_ratstars desc
limit 3) b
on a.supp_id=b.supp_id
inner join customer c
on b.cus_id=c.cus_id """

conObject.execute(query6)
out6=conObject.fetchall()
out6_Df=pd.DataFrame(out6,columns=['Supp_ID','Supp_Name','Rating','RatedBy_CustomerName'])
out6_Df

   Supp_ID       Supp_Name  Rating RatedBy_CustomerName
0        1  Rajesh Retails       5               PULKIT
1        2    Appario Ltd.       4                 AMAN
2        5     Mittal Ltd.       4                MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [9]:
query7="""select cus_name,cus_gender from customer
where cus_name like 'A%'
or cus_name like '%A'"""

conObject.execute(query7)
out7=conObject.fetchall()
out7_Df=pd.DataFrame(out7,columns=['Prod_ID','Product'])
out7_Df

  Prod_ID Product
0  AAKASH       M
1    AMAN       M
2    NEHA       F
3   MEGHA       F

### Q10) Display the total order amount of the male customers.

In [11]:
query8="""select sum(ord_amount) as Total_Order_Amount from orders a
inner join customer b
on a.cus_id=b.cus_id
where cus_gender='M'"""

conObject.execute(query8)
out8=conObject.fetchall()
out8_Df=pd.DataFrame(out8,columns=['Total_OderAmt_of_Male_Customer'])
out8_Df

  Total_OderAmt_of_Male_Customer
0                          34500

### Q11) Display all the Customers left outer join with  the orders

In [12]:
query9="""select a.* from customer a
left outer join orders b
on a.cus_id=b.cus_id"""

conObject.execute(query9)
out9=conObject.fetchall()
out9_Df=pd.DataFrame(out9,columns=['Cus_ID','Cus_Name','Cus_Phone','Cus_City','Cus_Gender'])
out9_Df

   Cus_ID Cus_Name   Cus_Phone Cus_City Cus_Gender
0       1   AAKASH  9999999999    DELHI          M
1       2     AMAN  9785463215    NOIDA          M
2       3     NEHA  9999999998   MUMBAI          F
3       4    MEGHA  9994562399  KOLKATA          F
4       5   PULKIT  7895999999  LUCKNOW          M

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)